                                                                       
                                            UNIQUE                     
                                            REF(USER276/MASTREF)       
     A          R CATLGREC                                             
     A            CATLGID   R               REFFLD(ID)                 
                                            TEXT('ID')                 
                                            COLHDG('ID')               
     A            CATLGNAM  R               REFFLD(NAME)               
                                            TEXT('CATALOG')            
                                            COLHDG('CATALOG')          
     A          K CATLGID                                              